
Функция СведенияОВнешнейОбработке() Экспорт
	мПараметрыРегистрации = Новый Структура;
	мПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
	мПараметрыРегистрации.Вставить("Версия", "0.1.0");
	мПараметрыРегистрации.Вставить("Назначение", Новый Массив);
	мПараметрыРегистрации.Вставить("Наименование", НСтр("ru = 'Тестер'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()));
	мПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	мПараметрыРегистрации.Вставить("Информация", "");
	мПараметрыРегистрации.Вставить("ВерсияБСП", "");
	мРеквизитыТабличнойЧасти = Метаданные.Справочники.ДополнительныеОтчетыИОбработки.ТабличныеЧасти.Команды.Реквизиты;
	мТаблицаКоманд = Новый ТаблицаЗначений;
	мТаблицаКоманд.Колонки.Добавить("Представление", мРеквизитыТабличнойЧасти.Представление.Тип);
	мТаблицаКоманд.Колонки.Добавить("Идентификатор", мРеквизитыТабличнойЧасти.Идентификатор.Тип);
	мТаблицаКоманд.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	мТаблицаКоманд.Колонки.Добавить("ПоказыватьОповещение", мРеквизитыТабличнойЧасти.ПоказыватьОповещение.Тип);
	мТаблицаКоманд.Колонки.Добавить("Модификатор", мРеквизитыТабличнойЧасти.Модификатор.Тип);
	мТаблицаКоманд.Колонки.Добавить("Скрыть", мРеквизитыТабличнойЧасти.Скрыть.Тип);
	
	мКоманда = мТаблицаКоманд.Добавить();
	мКоманда.Представление = НСтр("ru = 'Тестер'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	мКоманда.Идентификатор = "ФормаЗапуска";
	мКоманда.Использование = "ОткрытиеФормы";
	мКоманда.ПоказыватьОповещение = Ложь;
	мКоманда.Модификатор = "";
	мКоманда.Скрыть = Ложь;
	
	мПараметрыРегистрации.Вставить("Команды", мТаблицаКоманд);
	мПараметрыРегистрации.Вставить("Разрешения", Новый Массив);
	
	Возврат мПараметрыРегистрации;
КонецФункции

